In [1]:
import pandas as pd
import numpy as np

In [3]:
df=pd.read_csv("text.csv")

In [4]:
df

   1  2  3  4  nk
0  5  6  7  8  pk
1  8  5  3  5  dk
2  8  9  4  2  mk

In [5]:
df=pd.read_csv("text.csv",header=None)

In [6]:
df

   0  1  2  3   4
0  1  2  3  4  nk
1  5  6  7  8  pk
2  8  5  3  5  dk
3  8  9  4  2  mk

In [7]:
pd.read_csv("text.csv",header=None,nrows=2)

   0  1  2  3   4
0  1  2  3  4  nk
1  5  6  7  8  pk

In [20]:
pd.read_table('text.csv',sep=',',header=None)

   0  1  2  3   4
0  1  2  3  4  nk
1  5  6  7  8  pk
2  8  5  3  5  dk
3  8  9  4  2  mk

In [12]:
df.to_csv("text1.csv")

In [13]:
pd.read_csv("text1.csv")

   Unnamed: 0  0  1  2  3   4
0           0  1  2  3  4  nk
1           1  5  6  7  8  pk
2           2  8  5  3  5  dk
3           3  8  9  4  2  mk

In [14]:
import sys

In [16]:
df.to_csv(sys.stdout)

,0,1,2,3,4
0,1,2,3,4,nk
1,5,6,7,8,pk
2,8,5,3,5,dk
3,8,9,4,2,mk

In [17]:
df.to_csv(sys.stdout,sep='-')

-0-1-2-3-4
0-1-2-3-4-nk
1-5-6-7-8-pk
2-8-5-3-5-dk
3-8-9-4-2-mk

In [27]:
df.to_csv(sys.stdout,sep='-',columns=[1,2])

-1-2
0-2-3
1-6-7
2-5-3
3-9-4